/**********************************************************************************************//**
 * @file		def.h
 * @brief		常用定义.
 * @author		许云飞 (kindapple@163.com)
 * @version		1.0
 * @date		6/11/2015
 * @copyright	2010-2015 中国科学院声学研究所语言声学与内容理解重点实验室
 **************************************************************************************************/
#pragma once

/**********************************************************************************************//**
 * @def     SDKAPI
 * @brief   动态库接口.
 **************************************************************************************************/
#if defined(_WIN32) || defined(_WIN64)
#ifdef EXPORT_SDKAPI
#define SDKAPI __declspec(dllexport)
#else
#define SDKAPI __declspec(dllimport)
#endif
#else
#define SDKAPI
#endif

/**********************************************************************************************//**
 * @enum    RetCode
 * @brief   返回值的定义.
 **************************************************************************************************/
enum RetCode
{
    /** @brief	空指针. */
    StsNullPtr = -4,
    /** @brief	与模型相关的错误. */
    StsErrModel = -3,
    /** @brief	配置文件有误. */
    StsErrCfgItem = -2,
    /** @brief	无法加载配置文件. */
    StsErrCfgFile = -1,

    /** @brief	成功. */
    StsNoErr = 0
};